[
  {
    "id": "1",
    "title": "Tech Innovation Summit 2024",
    "date": "2024-03-15",
    "location": "San Francisco",
    "description": "Join industry leaders for cutting-edge tech discussions.",
    "fullDescription": "The Tech Innovation Summit 2024 brings together the brightest minds in technology to discuss the latest trends, innovations, and future directions in the tech industry. This full-day event features keynote speakers from major tech companies, interactive workshops, and networking opportunities with fellow professionals. Topics include AI, blockchain, cybersecurity, and sustainable technology solutions.",
    "time": "9:00 AM - 6:00 PM",
    "venue": "Moscone Center",
    "price": "$299",
    "organizer": "Tech Events Inc.",
    "category": "Technology"
  },
  {
    "id": "2",
    "title": "Digital Marketing Masterclass",
    "date": "2024-03-22",
    "location": "New York",
    "description": "Learn advanced digital marketing strategies from experts.",
    "fullDescription": "This comprehensive masterclass covers the latest digital marketing strategies and tactics that drive real results. Learn from industry experts about SEO, social media marketing, content strategy, email marketing, and conversion optimization. Perfect for marketing professionals, business owners, and entrepreneurs looking to enhance their digital presence.",
    "time": "10:00 AM - 4:00 PM",
    "venue": "Jacob K. Javits Convention Center",
    "price": "$199",
    "organizer": "Marketing Pro Academy",
    "category": "Marketing"
  },
  {
    "id": "3",
    "title": "Startup Pitch Competition",
    "date": "2024-04-05",
    "location": "Austin",
    "description": "Watch innovative startups pitch their ideas to investors.",
    "fullDescription": "An exciting competition where emerging startups present their innovative ideas to a panel of experienced investors and industry experts. This event showcases the next generation of entrepreneurs and their groundbreaking solutions across various industries. Attendees will witness live pitches, Q&A sessions, and networking opportunities with founders and investors.",
    "time": "2:00 PM - 8:00 PM",
    "venue": "Austin Convention Center",
    "price": "Free",
    "organizer": "Startup Austin",
    "category": "Business"
  },
  {
    "id": "4",
    "title": "Web Development Bootcamp",
    "date": "2024-04-12",
    "location": "Seattle",
    "description": "Intensive hands-on coding workshop for web developers.",
    "fullDescription": "A comprehensive bootcamp designed for aspiring and experienced web developers. This intensive workshop covers modern web development technologies including React, Node.js, databases, and deployment strategies. Participants will work on real projects and receive mentorship from senior developers. Perfect for career changers and developers looking to upgrade their skills.",
    "time": "9:00 AM - 5:00 PM",
    "venue": "Seattle Center",
    "price": "$399",
    "organizer": "Code Academy Northwest",
    "category": "Technology"
  },
  {
    "id": "5",
    "title": "Design Thinking Workshop",
    "date": "2024-04-18",
    "location": "Los Angeles",
    "description": "Creative problem-solving workshop for designers and innovators.",
    "fullDescription": "An interactive workshop that teaches the principles and methodologies of design thinking. Participants will learn how to approach complex problems with a human-centered design approach, develop empathy for users, and create innovative solutions. The workshop includes hands-on exercises, group activities, and real-world case studies from successful design projects.",
    "time": "1:00 PM - 6:00 PM",
    "venue": "LA Convention Center",
    "price": "$149",
    "organizer": "Design Innovators LA",
    "category": "Design"
  },
  {
    "id": "6",
    "title": "AI & Machine Learning Conference",
    "date": "2024-05-03",
    "location": "Boston",
    "description": "Explore the latest developments in AI and machine learning.",
    "fullDescription": "A premier conference focusing on artificial intelligence and machine learning advancements. Features presentations from leading researchers, industry practitioners, and academic experts. Topics include deep learning, natural language processing, computer vision, and ethical AI. Includes technical sessions, poster presentations, and hands-on workshops with cutting-edge AI tools.",
    "time": "8:00 AM - 7:00 PM",
    "venue": "Boston Convention & Exhibition Center",
    "price": "$449",
    "organizer": "AI Research Institute",
    "category": "Technology"
  },
  {
    "id": "7",
    "title": "Sustainable Business Summit",
    "date": "2024-05-15",
    "location": "Portland",
    "description": "Discover sustainable practices for modern businesses.",
    "fullDescription": "A comprehensive summit dedicated to sustainable business practices and environmental responsibility. Learn from industry leaders about implementing green initiatives, reducing carbon footprint, and building sustainable supply chains. The event covers topics like renewable energy, waste reduction, sustainable finance, and corporate social responsibility.",
    "time": "9:30 AM - 5:30 PM",
    "venue": "Oregon Convention Center",
    "price": "$249",
    "organizer": "Green Business Alliance",
    "category": "Business"
  },
  {
    "id": "8",
    "title": "Creative Photography Workshop",
    "date": "2024-05-22",
    "location": "Miami",
    "description": "Master advanced photography techniques with professional photographers.",
    "fullDescription": "An intensive photography workshop led by award-winning professional photographers. Learn advanced techniques in portrait, landscape, and street photography. The workshop covers lighting, composition, post-processing, and building a photography portfolio. Includes hands-on shooting sessions, critique sessions, and one-on-one mentoring opportunities.",
    "time": "10:00 AM - 6:00 PM",
    "venue": "Miami Beach Convention Center",
    "price": "$179",
    "organizer": "Miami Photo Society",
    "category": "Arts"
  }
]
